Revit API Introduction Labs
Lab2_2_ModelElements Class
 List all model elements.
 Model elements are generally part of the building and have geometry. In this lab we will implement a filter to retrieve all model elements, i.e. Revit element instances with a 3D geometrical representation. There are several possible approaches to retrieving these elements. Here, we will present a method that uses a combination of different criteria to ensure that only valid model elements are selected. The criteria applied to each element are:
It is not an ElementType object
It has a valid category
The category has material quantities
To complete this lab, perform the following steps:
Add a new read-only external command implementation named Lab2_2_ModelElements to the Labs2 module.
Implement code to access the Revit application and current document.
Instantiate a new FilteredElementCollector variable named collector.
Retrieve all elements that are not of type ElementType (hint: use WhereElementIsNotElementType).
Instantiate a variable named 'a' as a list of strings to collect the element information and later feed to the approriate LabUtils.InfoMsg overload.
Loop over the collected elements (hint: you can simply use foreach Element e in collector).
Ignore all elements with an invalid, i.e. null, category.
Ignore all elements whose category does not have material quantities, cf. the Category.HasMaterialQuantities property.
Populate 'a' with some element data such as category name, element name, and element id.
Display the contents of 'a' using the appropriate LabUtils.InfoMsg overload.
Return a Failed result code, since we did nothing to modify the database.
Here is one possible implementation of these steps:
CopyC#
UIApplication app = commandData.Application;
Document doc = app.ActiveUIDocument.Document;
FilteredElementCollector collector
  = new FilteredElementCollector( doc )
    .WhereElementIsNotElementType();
List<string> a = new List<string>();
// we could use a LINQ query here instead:
foreach( Element e in collector )
{
  //  && null != e.Materials
  //  && 0 < e.Materials.Size
  if( null != e.Category
    && e.Category.HasMaterialQuantities )
  {
    a.Add( string.Format(
      "Category={0}; Name={1}; Id={2}",
      e.Category.Name, e.Name, e.Id.IntegerValue ) );
  }
}
LabUtils.InfoMsg( "Project contains {0} model element{1}{2}", a );
return Result.Failed;
CopyVB.NET
Dim app As UIApplication = commandData.Application
Dim doc As Document = app.ActiveUIDocument.Document
Dim collector As FilteredElementCollector _
    = New FilteredElementCollector(doc) _
        .WhereElementIsNotElementType()
Dim a As New List(Of String)()
' we could use a LINQ query here instead:
For Each e As Element In collector
    ' && null != e.Materials
    ' && 0 < e.Materials.Size
    If e.Category IsNot Nothing AndAlso e.Category.HasMaterialQuantities Then
        a.Add(String.Format("Category={0}; Name={1}; Id={2}", _
                            e.Category.Name, e.Name, e.Id.IntegerValue))
    End If
Next
LabUtils.InfoMsg("Project contains {0} model element{1}{2}", a)
Return Result.Failed
 Compile, link and load the project as usual. Step through the code in the debugger and examine how many elements are eliminated by the various filtering steps.
 A useful additional functionality would be to differentiate between visible and hidden elements.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public class Lab2_2_ModelElements : IExternalCommand
Visual Basic (Declaration)
Public Class Lab2_2_ModelElements _
	Implements IExternalCommand
Visual C++
public ref class Lab2_2_ModelElements : IExternalCommand
Remarks
A useful additional functionality would be to differentiate between visible and hidden elements.
 If you are just looking for Walls, Windows and Doors, I would use a filter that collects those items (LogicalOrFilter). If you are looking to exclude certain types, like GraphicsStyles and Views and Levels, you can do that also using LogicalAndFilters. You could also try the BoundingBox filters, I think those will skip elements like GraphicsStyles and Materials and Annotations which don’t have geometry, but not elements like Levels and Views. I would get the bounding box of a default 3D view, and use the bounding box filter which passes elements inside or intersecting it.
Inheritance Hierarchy
System.Object
 Labs.Lab2_2_ModelElements
See Also
Lab2_2_ModelElements Members
Labs Namespace